apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
/* CSTRACE */
#define CSTRACE_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CSTRACE_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CSTRACE_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CSTRACE_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CSTRACE_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define CSTRACE_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define CSTRACE_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD1)
#define CSTRACE_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2)

/* M4_SYSTICK */
#define M4_SYSTICK_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define M4_SYSTICK_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define M4_SYSTICK_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define M4_SYSTICK_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define M4_SYSTICK_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define M4_SYSTICK_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define M4_SYSTICK_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define M4_SYSTICK_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* M7_SYSTICK */
#define M7_SYSTICK_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define M7_SYSTICK_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define M7_SYSTICK_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define M7_SYSTICK_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define M7_SYSTICK_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define M7_SYSTICK_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define M7_SYSTICK_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define M7_SYSTICK_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD0)

/* ADC1 */
#define ADC1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ADC1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ADC1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ADC1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ADC1_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define ADC1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ADC1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define ADC1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* ADC2 */
#define ADC2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ADC2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ADC2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ADC2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ADC2_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define ADC2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ADC2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define ADC2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* ACMP */
#define ACMP_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ACMP_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ACMP_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ACMP_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ACMP_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3)
#define ACMP_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ACMP_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ACMP_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* FLEXIO1 */
#define FLEXIO1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define FLEXIO1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define FLEXIO1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define FLEXIO1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define FLEXIO1_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define FLEXIO1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define FLEXIO1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define FLEXIO1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* FLEXIO2 */
#define FLEXIO2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define FLEXIO2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define FLEXIO2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define FLEXIO2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define FLEXIO2_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define FLEXIO2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define FLEXIO2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define FLEXIO2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* GPT1 */
#define GPT1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define GPT1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define GPT1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define GPT1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define GPT1_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define GPT1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define GPT1_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define GPT1_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL3_PFD3)

/* GPT2 */
#define GPT2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define GPT2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define GPT2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define GPT2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define GPT2_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define GPT2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define GPT2_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define GPT2_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* GPT3 */
#define GPT3_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define GPT3_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define GPT3_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define GPT3_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define GPT3_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define GPT3_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define GPT3_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define GPT3_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

