apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
/* LPUART6 */
#define LPUART6_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART6_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART6_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART6_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART6_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPUART6_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPUART6_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPUART6_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPUART7 */
#define LPUART7_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART7_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART7_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART7_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART7_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPUART7_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPUART7_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPUART7_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPUART8 */
#define LPUART8_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART8_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART8_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART8_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART8_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPUART8_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPUART8_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPUART8_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPUART9 */
#define LPUART9_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART9_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART9_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART9_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART9_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPUART9_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPUART9_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPUART9_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPUART10 */
#define LPUART10_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART10_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART10_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART10_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART10_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPUART10_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPUART10_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPUART10_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPUART11 */
#define LPUART11_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART11_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART11_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART11_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART11_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPUART11_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPUART11_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD3)
#define LPUART11_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* LPUART12 */
#define LPUART12_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPUART12_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPUART12_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPUART12_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPUART12_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPUART12_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPUART12_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD3)
#define LPUART12_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* LPI2C1 */
#define LPI2C1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C1_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPI2C1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPI2C1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPI2C1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPI2C2 */
#define LPI2C2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C2_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPI2C2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPI2C2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPI2C2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPI2C3 */
#define LPI2C3_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C3_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C3_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C3_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C3_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPI2C3_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPI2C3_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPI2C3_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPI2C4 */
#define LPI2C4_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C4_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C4_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C4_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C4_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define LPI2C4_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPI2C4_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPI2C4_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPI2C5 */
#define LPI2C5_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C5_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C5_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C5_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C5_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPI2C5_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPI2C5_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD3)
#define LPI2C5_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* LPI2C6 */
#define LPI2C6_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPI2C6_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPI2C6_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPI2C6_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPI2C6_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPI2C6_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPI2C6_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD3)
#define LPI2C6_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

