apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
/* LPSPI1 */
#define LPSPI1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI1_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPSPI1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPSPI1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPSPI2 */
#define LPSPI2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI2_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPSPI2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPSPI2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPSPI3 */
#define LPSPI3_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI3_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI3_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI3_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI3_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI3_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPSPI3_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPSPI3_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPSPI4 */
#define LPSPI4_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI4_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI4_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI4_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI4_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI4_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define LPSPI4_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define LPSPI4_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* LPSPI5 */
#define LPSPI5_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI5_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI5_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI5_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI5_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPSPI5_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPSPI5_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI5_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* LPSPI6 */
#define LPSPI6_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LPSPI6_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LPSPI6_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LPSPI6_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LPSPI6_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define LPSPI6_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define LPSPI6_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define LPSPI6_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* EMV1 */
#define EMV1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define EMV1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define EMV1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define EMV1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define EMV1_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define EMV1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define EMV1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define EMV1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* EMV2 */
#define EMV2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define EMV2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define EMV2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define EMV2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define EMV2_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define EMV2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define EMV2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2)
#define EMV2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* ENET1 */
#define ENET1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET1_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET1_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET1_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET2 */
#define ENET2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET2_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET2_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET2_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET_QOS */
#define ENET_QOS_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET_QOS_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET_QOS_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET_QOS_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET_QOS_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET_QOS_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET_QOS_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET_QOS_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET_25M */
#define ENET_25M_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET_25M_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET_25M_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET_25M_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET_25M_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET_25M_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET_25M_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET_25M_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET_TIMER1 */
#define ENET_TIMER1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET_TIMER1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET_TIMER1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET_TIMER1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET_TIMER1_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET_TIMER1_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET_TIMER1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET_TIMER1_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET_TIMER2 */
#define ENET_TIMER2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET_TIMER2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET_TIMER2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET_TIMER2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET_TIMER2_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET_TIMER2_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET_TIMER2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET_TIMER2_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* ENET_TIMER3 */
#define ENET_TIMER3_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ENET_TIMER3_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ENET_TIMER3_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ENET_TIMER3_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ENET_TIMER3_CLK_ROOT_SYS_PLL1_DIV2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV2)
#define ENET_TIMER3_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(5U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ENET_TIMER3_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ENET_TIMER3_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD1)

/* USDHC1 */
#define USDHC1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define USDHC1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define USDHC1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define USDHC1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define USDHC1_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define USDHC1_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define USDHC1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define USDHC1_CLK_ROOT_PLL_ARM_CLK     ROOT_MUX(7U) | CLOCK_NAME(PLL_ARM_CLK)

