apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
/* USDHC2 */
#define USDHC2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define USDHC2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define USDHC2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define USDHC2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define USDHC2_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define USDHC2_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define USDHC2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define USDHC2_CLK_ROOT_PLL_ARM_CLK     ROOT_MUX(7U) | CLOCK_NAME(PLL_ARM_CLK)

/* ASRC */
#define ASRC_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define ASRC_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define ASRC_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define ASRC_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define ASRC_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define ASRC_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define ASRC_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define ASRC_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* MQS */
#define MQS_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define MQS_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define MQS_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define MQS_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define MQS_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define MQS_CLK_ROOT_SYS_PLL3_DIV2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_DIV2)
#define MQS_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define MQS_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* MIC */
#define MIC_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define MIC_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define MIC_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define MIC_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define MIC_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define MIC_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define MIC_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define MIC_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* SPDIF */
#define SPDIF_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define SPDIF_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define SPDIF_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define SPDIF_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define SPDIF_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(4U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define SPDIF_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define SPDIF_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define SPDIF_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* SAI1 */
#define SAI1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define SAI1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define SAI1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define SAI1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define SAI1_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(4U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define SAI1_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define SAI1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define SAI1_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* SAI2 */
#define SAI2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define SAI2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define SAI2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define SAI2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define SAI2_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(4U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define SAI2_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define SAI2_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define SAI2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* SAI3 */
#define SAI3_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define SAI3_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define SAI3_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define SAI3_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define SAI3_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(4U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define SAI3_CLK_ROOT_SYS_PLL3_PFD2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3_PFD2)
#define SAI3_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL1_DIV5)
#define SAI3_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL2_PFD3)

/* SAI4 */
#define SAI4_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define SAI4_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define SAI4_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define SAI4_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define SAI4_CLK_ROOT_SYS_PLL3_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL3_PFD3)
#define SAI4_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define SAI4_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(6U) | CLOCK_NAME(AUDIO_PLL_CLK)
#define SAI4_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* GC355 */
#define GC355_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define GC355_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define GC355_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define GC355_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define GC355_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define GC355_CLK_ROOT_SYS_PLL2_PFD1   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD1)
#define GC355_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3)
#define GC355_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* LCDIF */
#define LCDIF_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LCDIF_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LCDIF_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LCDIF_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LCDIF_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define LCDIF_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define LCDIF_CLK_ROOT_SYS_PLL3_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD0)
#define LCDIF_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

