apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
/* LCDIFV2 */
#define LCDIFV2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define LCDIFV2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define LCDIFV2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define LCDIFV2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define LCDIFV2_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define LCDIFV2_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define LCDIFV2_CLK_ROOT_SYS_PLL3_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD0)
#define LCDIFV2_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* MIPI_REF */
#define MIPI_REF_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define MIPI_REF_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define MIPI_REF_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define MIPI_REF_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define MIPI_REF_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define MIPI_REF_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define MIPI_REF_CLK_ROOT_SYS_PLL3_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD0)
#define MIPI_REF_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* MIPI_ESC */
#define MIPI_ESC_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define MIPI_ESC_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define MIPI_ESC_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define MIPI_ESC_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define MIPI_ESC_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2)
#define MIPI_ESC_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define MIPI_ESC_CLK_ROOT_SYS_PLL3_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD0)
#define MIPI_ESC_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* CSI2 */
#define CSI2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CSI2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CSI2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CSI2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CSI2_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define CSI2_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define CSI2_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define CSI2_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* CSI2_ESC */
#define CSI2_ESC_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CSI2_ESC_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CSI2_ESC_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CSI2_ESC_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CSI2_ESC_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define CSI2_ESC_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define CSI2_ESC_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define CSI2_ESC_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* CSI2_UI */
#define CSI2_UI_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CSI2_UI_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CSI2_UI_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CSI2_UI_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CSI2_UI_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define CSI2_UI_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define CSI2_UI_CLK_ROOT_SYS_PLL2_PFD0   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL2_PFD0)
#define CSI2_UI_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* CSI */
#define CSI_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CSI_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CSI_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CSI_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CSI_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define CSI_CLK_ROOT_SYS_PLL3_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL3)
#define CSI_CLK_ROOT_SYS_PLL3_PFD1   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD1)
#define CSI_CLK_ROOT_VIDEO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(VIDEO_PLL_CLK)

/* CKO1 */
#define CKO1_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CKO1_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CKO1_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CKO1_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CKO1_CLK_ROOT_SYS_PLL2_PFD2   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD2)
#define CKO1_CLK_ROOT_SYS_PLL2_CLK    ROOT_MUX(5U) | CLOCK_NAME(SYS_PLL2)
#define CKO1_CLK_ROOT_SYS_PLL3_PFD1   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD1)
#define CKO1_CLK_ROOT_SYS_PLL1_DIV5   ROOT_MUX(7U) | CLOCK_NAME(SYS_PLL1_DIV5)

/* CKO2 */
#define CKO2_CLK_ROOT_OSC_RC_48M_DIV2 ROOT_MUX(0U) | CLOCK_NAME(OSC_RC_48M_DIV2)
#define CKO2_CLK_ROOT_OSC_24M         ROOT_MUX(1U) | CLOCK_NAME(OSC_24M)
#define CKO2_CLK_ROOT_OSC_RC_400M     ROOT_MUX(2U) | CLOCK_NAME(OSC_RC_400M)
#define CKO2_CLK_ROOT_OSC_RC_16M      ROOT_MUX(3U) | CLOCK_NAME(OSC_RC_16M)
#define CKO2_CLK_ROOT_SYS_PLL2_PFD3   ROOT_MUX(4U) | CLOCK_NAME(SYS_PLL2_PFD3)
#define CKO2_CLK_ROOT_OSC_RC_48M      ROOT_MUX(5U) | CLOCK_NAME(OSC_RC_48M)
#define CKO2_CLK_ROOT_SYS_PLL3_PFD1   ROOT_MUX(6U) | CLOCK_NAME(SYS_PLL3_PFD1)
#define CKO2_CLK_ROOT_AUDIO_PLL_CLK   ROOT_MUX(7U) | CLOCK_NAME(AUDIO_PLL_CLK)

/****************************************************************************
 * Public Types
 ****************************************************************************/

typedef enum ccm_clock_name
{
    OSC_RC_16M      = 0,  /* 16MHZ RC OSCILLATOR. */
    OSC_RC_48M      = 1,  /* 48MHZ RC OSCILLATOR. */
    OSC_RC_48M_DIV2 = 2,  /* 48MHZ RC OSCILLATOR DIV2. */
    OSC_RC_400M     = 3,  /* 400MHZ RC OSCILLATOR. */
    OSC_24M         = 4,  /* 24MHZ OSCILLATOR. */
    PLL_ARM_CLK     = 6,  /* ARM PLL. */
    SYS_PLL2        = 8,  /* SYS PLL2. */
    SYS_PLL2_PFD0   = 10, /* SYS PLL2 PFD0. */
    SYS_PLL2_PFD1   = 11, /* SYS PLL2 PFD1. */
    SYS_PLL2_PFD2   = 12, /* SYS PLL2 PFD2. */
    SYS_PLL2_PFD3   = 13, /* SYS PLL2 PFD3. */
    SYS_PLL3        = 14, /* SYS PLL3. */
    SYS_PLL3_DIV2   = 16, /* SYS PLL3 DIV2 */
    SYS_PLL3_PFD0   = 17, /* SYS PLL3 PFD0. */
    SYS_PLL3_PFD1   = 18, /* SYS PLL3 PFD1 */
    SYS_PLL3_PFD2   = 19, /* SYS PLL3 PFD2 */
    SYS_PLL3_PFD3   = 20, /* SYS PLL3 PFD3 */
    SYS_PLL1        = 21, /* SYS PLL1. */
    SYS_PLL1_DIV2   = 23, /* SYS PLL1 DIV2. */
    SYS_PLL1_DIV5   = 24, /* SYS PLL1 DIV5. */
    AUDIO_PLL_CLK   = 25, /* SYS AUDIO PLL. */
    VIDEO_PLL_CLK   = 27, /* SYS VIDEO PLL. */
} ccm_clock_name;

/* Clock Configuration ******************************************************/

