apache/nuttx/arch/arm/src/imxrt/imxrt_clockconfig_ver2.h
struct ccm_clock_root
{
    uint8_t                 enable;
    uint8_t                 div;
    uint8_t                 mux;
};

struct ccm_clock_root_config_s
{
  union
  {
    struct
    {
      struct ccm_clock_root m7_clk_root;
      struct ccm_clock_root m4_clk_root;
      struct ccm_clock_root bus_clk_root;
      struct ccm_clock_root bus_lpsr_clk_root;
      struct ccm_clock_root semc_clk_root;
      struct ccm_clock_root cssys_clk_root;
      struct ccm_clock_root cstrace_clk_root;
      struct ccm_clock_root m4_systick_clk_root;
      struct ccm_clock_root m7_systick_clk_root;
      struct ccm_clock_root adc1_clk_root;
      struct ccm_clock_root adc2_clk_root;
      struct ccm_clock_root acmp_clk_root;
      struct ccm_clock_root flexio1_clk_root;
      struct ccm_clock_root flexio2_clk_root;
      struct ccm_clock_root gpt1_clk_root;
      struct ccm_clock_root gpt2_clk_root;
      struct ccm_clock_root gpt3_clk_root;
      struct ccm_clock_root gpt4_clk_root;
      struct ccm_clock_root gpt5_clk_root;
      struct ccm_clock_root gpt6_clk_root;
      struct ccm_clock_root flexspi1_clk_root;
      struct ccm_clock_root flexspi2_clk_root;
      struct ccm_clock_root can1_clk_root;
      struct ccm_clock_root can2_clk_root;
      struct ccm_clock_root can3_clk_root;
      struct ccm_clock_root lpuart1_clk_root;
      struct ccm_clock_root lpuart2_clk_root;
      struct ccm_clock_root lpuart3_clk_root;
      struct ccm_clock_root lpuart4_clk_root;
      struct ccm_clock_root lpuart5_clk_root;
      struct ccm_clock_root lpuart6_clk_root;
      struct ccm_clock_root lpuart7_clk_root;
      struct ccm_clock_root lpuart8_clk_root;
      struct ccm_clock_root lpuart9_clk_root;
      struct ccm_clock_root lpuart10_clk_root;
      struct ccm_clock_root lpuart11_clk_root;
      struct ccm_clock_root lpuart12_clk_root;
      struct ccm_clock_root lpi2c1_clk_root;
      struct ccm_clock_root lpi2c2_clk_root;
      struct ccm_clock_root lpi2c3_clk_root;
      struct ccm_clock_root lpi2c4_clk_root;
      struct ccm_clock_root lpi2c5_clk_root;
      struct ccm_clock_root lpi2c6_clk_root;
      struct ccm_clock_root lpspi1_clk_root;
      struct ccm_clock_root lpspi2_clk_root;
      struct ccm_clock_root lpspi3_clk_root;
      struct ccm_clock_root lpspi4_clk_root;
      struct ccm_clock_root lpspi5_clk_root;
      struct ccm_clock_root lpspi6_clk_root;
      struct ccm_clock_root emv1_clk_root;
      struct ccm_clock_root emv2_clk_root;
      struct ccm_clock_root enet1_clk_root;
      struct ccm_clock_root enet2_clk_root;
      struct ccm_clock_root enet_qos_clk_root;
      struct ccm_clock_root enet_25m_clk_root;
      struct ccm_clock_root enet_timer1_clk_root;
      struct ccm_clock_root enet_timer2_clk_root;
      struct ccm_clock_root enet_timer3_clk_root;
      struct ccm_clock_root usdhc1_clk_root;
      struct ccm_clock_root usdhc2_clk_root;
      struct ccm_clock_root asrc_clk_root;
      struct ccm_clock_root mqs_clk_root;
      struct ccm_clock_root mic_clk_root;
      struct ccm_clock_root spdif_clk_root;
      struct ccm_clock_root sai1_clk_root;
      struct ccm_clock_root sai2_clk_root;
      struct ccm_clock_root sai3_clk_root;
      struct ccm_clock_root sai4_clk_root;
      struct ccm_clock_root gc355_clk_root;
      struct ccm_clock_root lcdif_clk_root;
      struct ccm_clock_root lcdifv2_clk_root;
      struct ccm_clock_root mipi_ref_clk_root;
      struct ccm_clock_root mipi_esc_clk_root;
      struct ccm_clock_root csi2_clk_root;
      struct ccm_clock_root csi2_esc_clk_root;
      struct ccm_clock_root csi2_ui_clk_root;
      struct ccm_clock_root csi_clk_root;
      struct ccm_clock_root cko1_clk_root;
      struct ccm_clock_root cko2_clk_root;
    };
    struct ccm_clock_root clock_root[IMXRT_CCM_CR_COUNT];
  };
};

struct ccm_arm_pll
{
    uint8_t  post_div;
    uint8_t  loop_div;
};

struct ccm_sys_pll1
{
    uint32_t  enable;
    uint8_t   div;
    uint32_t  num;
    uint32_t  denom;
};

struct ccm_sys_pll2
{
    uint32_t mfd;
    uint32_t ss;
    uint8_t  ss_enable;
    uint16_t ss_stop;
    uint16_t ss_step;
    uint32_t pfd0;
    uint32_t pfd1;
    uint32_t pfd2;
    uint32_t pfd3;
};

struct ccm_sys_pll3
{
    uint32_t pfd0;
    uint32_t pfd1;
    uint32_t pfd2;
    uint32_t pfd3;
};

struct clock_configuration_s
{
  struct ccm_clock_root_config_s ccm;  /* CCM Root Clock configuration */
  struct ccm_arm_pll             arm_pll;
  struct ccm_sys_pll1            sys_pll1;
  struct ccm_sys_pll2            sys_pll2;
  struct ccm_sys_pll3            sys_pll3;
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

/* Each IMXRT117X board must provide the following initialized structure.
 *  This is needed to establish the initial board clocking.
 */

extern const struct clock_configuration_s g_initial_clkconfig;

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_clockconfig
 *
 * Description:
 *   Called to initialize the i.MXRT.  This does whatever setup is needed to
 *   put the SoC in a usable state.  This includes the initialization of
 *   clocking using the settings in board.h.
 *
 ****************************************************************************/

void imxrt_clockconfig(void);

/****************************************************************************
 * Name: imxrt_get_clock
 *
 * Description:
 *   This function returns the clock frequency of the specified functional
 *   clock.
 *
 * Input Parameters:
 *   clkname   - Identifies the clock of interest
 *   frequency - The location where the peripheral clock frequency will be
 *              returned
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.  -ENODEV is returned if the clock is not enabled or is not
 *   being clocked.
 *
 ****************************************************************************/

int imxrt_get_clock(enum ccm_clock_name clkname, uint32_t *frequency);

/****************************************************************************
 * Name: imxrt_get_rootclock
 *
 * Description:
 *   This function returns the clock frequency of the specified root
 *   functional clock.
 *
 * Input Parameters:
 *   clkroot   - Identifies the peripheral clock of interest
 *   frequency - The location where the peripheral clock frequency will be
 *              returned
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.  -ENODEV is returned if the clock is not enabled or is not
 *   being clocked.
 *
 ****************************************************************************/

int imxrt_get_rootclock(uint32_t clkroot, uint32_t *frequency);

#endif /* __ARCH_ARM_SRC_IMXRT_IMXRT_CLOCKCONFIG_VER2_H */
